## 
## Cadence First Encounter "v08.10-p004_1 ((32bit) 11/04/2008 14:34 (Linux 2.6))"
## Fri Oct 10 13:02:06 2025
## 
set sdc_version 1.4
current_design SYS_TOP
create_clock [get_ports {REF_CLK}]  -name ref_clk -period 20 -waveform {0 10}
set_clock_latency -min 0 [get_clocks {ref_clk}]
set_clock_latency -max 0 [get_clocks {ref_clk}]
set_clock_transition  -rise -min 0.05 [get_clocks {ref_clk}]
set_clock_transition  -rise -max 0.05 [get_clocks {ref_clk}]
set_clock_transition  -fall -min 0.05 [get_clocks {ref_clk}]
set_clock_transition  -fall -max 0.05 [get_clocks {ref_clk}]
create_clock [get_ports {UART_CLK}]  -name uart_clk -period 271.3 -waveform {0 135.65}
set_clock_latency -min 0 [get_clocks {uart_clk}]
set_clock_latency -max 0 [get_clocks {uart_clk}]
set_clock_transition  -rise -min 0.05 [get_clocks {uart_clk}]
set_clock_transition  -rise -max 0.05 [get_clocks {uart_clk}]
set_clock_transition  -fall -min 0.05 [get_clocks {uart_clk}]
set_clock_transition  -fall -max 0.05 [get_clocks {uart_clk}]
create_clock [get_ports {scan_clk}]  -name scan_clk -period 20 -waveform {0 10}
set_clock_latency -min 0 [get_clocks {scan_clk}]
set_clock_latency -max 0 [get_clocks {scan_clk}]
set_clock_transition  -rise -min 0.1 [get_clocks {scan_clk}]
set_clock_transition  -rise -max 0.1 [get_clocks {scan_clk}]
set_clock_transition  -fall -min 0.1 [get_clocks {scan_clk}]
set_clock_transition  -fall -max 0.1 [get_clocks {scan_clk}]
create_generated_clock -name tx_clk -source [get_ports {UART_CLK}] -divide_by 32 -master_clock [get_clocks {uart_clk}] -add [get_pins {A10/U15/Y}]
create_generated_clock -name rx_clk -source [get_ports {UART_CLK}] -divide_by 1 -master_clock [get_clocks {uart_clk}] -add [get_pins {A11/U16/Y}]
create_generated_clock -name Gated_Clock -source [get_ports {REF_CLK}] -divide_by 1 -master_clock [get_clocks {ref_clk}] -add [get_pins {A2/U0_TLATNCAX4M/ECK}]
set_propagated_clock  [get_ports {UART_CLK}]
set_propagated_clock  [get_pins {A11/U16/Y}]
set_propagated_clock  [get_ports {scan_clk}]
set_propagated_clock  [get_pins {A10/U15/Y}]
set_propagated_clock  [get_ports {REF_CLK}]
set_propagated_clock  [get_pins {A2/U0_TLATNCAX4M/ECK}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -rise -min -pin Y -from_pin A [get_ports {REF_CLK}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -fall -min -pin Y -from_pin A [get_ports {REF_CLK}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -rise -max -pin Y -from_pin A [get_ports {REF_CLK}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -fall -max -pin Y -from_pin A [get_ports {REF_CLK}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -rise -min -pin Y -from_pin A [get_ports {RST_N}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -fall -min -pin Y -from_pin A [get_ports {RST_N}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -rise -max -pin Y -from_pin A [get_ports {RST_N}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -fall -max -pin Y -from_pin A [get_ports {RST_N}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -rise -min -pin Y -from_pin A [get_ports {UART_CLK}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -fall -min -pin Y -from_pin A [get_ports {UART_CLK}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -rise -max -pin Y -from_pin A [get_ports {UART_CLK}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -fall -max -pin Y -from_pin A [get_ports {UART_CLK}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -rise -min -pin Y -from_pin A [get_ports {UART_RX_IN}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -fall -min -pin Y -from_pin A [get_ports {UART_RX_IN}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -rise -max -pin Y -from_pin A [get_ports {UART_RX_IN}]
set_driving_cell -lib_cell BUFX2M -library scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c -fall -max -pin Y -from_pin A [get_ports {UART_RX_IN}]
set_load -pin_load -max  0.1  [get_ports {UART_TX_O}]
set_load -pin_load -min  0.1  [get_ports {UART_TX_O}]
set_load -pin_load -max  0.1  [get_ports {framing_error}]
set_load -pin_load -min  0.1  [get_ports {framing_error}]
set_load -pin_load -max  0.1  [get_ports {parity_error}]
set_load -pin_load -min  0.1  [get_ports {parity_error}]
set_case_analysis 0 [get_ports {SE}]
set_case_analysis 1 [get_ports {test_mode}]
set_input_delay -add_delay 4 -clock [get_clocks {scan_clk}] [get_ports {test_mode}]
set_input_delay -add_delay 4 -clock [get_clocks {scan_clk}] [get_ports {SI}]
set_input_delay -add_delay 4 -clock [get_clocks {rx_clk}] [get_ports {UART_RX_IN}]
set_input_delay -add_delay 4 -clock [get_clocks {scan_clk}] [get_ports {SE}]
set_output_delay -add_delay 4 -clock [get_clocks {tx_clk}] [get_ports {UART_TX_O}]
set_output_delay -add_delay 4 -clock [get_clocks {tx_clk}] [get_ports {framing_error}]
set_output_delay -add_delay 4 -clock [get_clocks {scan_clk}] [get_ports {SO}]
set_output_delay -add_delay 4 -clock [get_clocks {tx_clk}] [get_ports {parity_error}]
set_clock_uncertainty 0.1 -hold [get_clocks {scan_clk}]
set_clock_uncertainty 0.2 -setup [get_clocks {scan_clk}]
set_clock_uncertainty 0.1 -hold [get_clocks {tx_clk}]
set_clock_uncertainty 0.2 -setup [get_clocks {tx_clk}]
set_clock_uncertainty 0.1 -hold [get_clocks {Gated_Clock}]
set_clock_uncertainty 0.2 -setup [get_clocks {Gated_Clock}]
set_clock_uncertainty 0.1 -hold [get_clocks {uart_clk}]
set_clock_uncertainty 0.2 -setup [get_clocks {uart_clk}]
set_clock_uncertainty 0.1 -hold [get_clocks {ref_clk}]
set_clock_uncertainty 0.2 -setup [get_clocks {ref_clk}]
set_clock_uncertainty 0.1 -hold [get_clocks {rx_clk}]
set_clock_uncertainty 0.2 -setup [get_clocks {rx_clk}]
set_clock_groups -name scan_clk_1 -asynchronous  -group  [get_clocks {scan_clk}] -group  [get_clocks {Gated_Clock ref_clk}]
set_clock_groups -name uart_clk_1 -asynchronous  -group  [get_clocks {rx_clk tx_clk uart_clk}] -group  [get_clocks {ref_clk}]
set_clock_groups -name uart_clk_2 -asynchronous  -group  [get_clocks {rx_clk tx_clk uart_clk}] -group  [get_clocks {Gated_Clock ref_clk}]
set_clock_groups -name uart_clk_3 -asynchronous  -group  [get_clocks {rx_clk tx_clk uart_clk}] -group  [get_clocks {scan_clk}]
