                                                 
set top_module SYS_TOP
                                                 
define_design_lib work -path ./work
                                                
set_svf SYS_TOP.svf


lappend search_path /home/IC/Projects/std_cells
lappend search_path /home/IC/Projects/rtl

set SSLIB "scmetro_tsmc_cl013g_rvt_ss_1p08v_125c.db"
set TTLIB "scmetro_tsmc_cl013g_rvt_tt_1p2v_25c.db"
set FFLIB "scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c.db"
 
set target_library [list $SSLIB $TTLIB $FFLIB]

set link_library [list * $SSLIB $TTLIB $FFLIB] 

analyze -format verilog SYS_TOP.v
analyze -format verilog sys_ctrl.v
analyze -format verilog alu.v
analyze -format verilog CLK_GATE.v
analyze -format verilog reg_file.v
analyze -format verilog reset_sync.v
analyze -format verilog data_sync.v
analyze -format verilog fifo_top.v
analyze -format verilog fifo_wptr.v
analyze -format verilog fifo_memory.v
analyze -format verilog fifo_rptr.v
analyze -format verilog BIT_SYNC.v
analyze -format verilog pluse_gen.v
analyze -format verilog UART_RX.v
analyze -format verilog uart_rx_fsm.v
analyze -format verilog edge_bit_counter.v
analyze -format verilog data_sampling.v
analyze -format verilog deserializer.v
analyze -format verilog strt_chk.v
analyze -format verilog par_chk.v
analyze -format verilog stp_chk.v
analyze -format verilog clock_divider.v
analyze -format verilog pre_mux.v
analyze -format verilog uart_tr.v
analyze -format verilog fsm_uart.v
analyze -format verilog mux4_1.v
analyze -format verilog parity_calc.v
analyze -format verilog serializer.v
analyze -format verilog mux2X1.v

elaborate -lib WORK SYS_TOP

current_design SYS_TOP


link 


check_design >> reports/check_design.rpt


source -echo ./cons.tcl



set_scan_configuration -clock_mixing no_mix -style multiplexed_flip_flop -replace true -max_length 100

compile -scan


set test_default_period 100
set test_default_delay 0
set test_default_bidir_delay 0
set test_default_strobe 20
set test_default_strobe_width 0


set_dft_signal -port [get_ports scan_clk]  -type ScanClock   -view existing_dft -timing {30 60}
set_dft_signal -port [get_ports scan_rst]  -type Reset       -view existing_dft -active_state 0
set_dft_signal -port [get_ports test_mode] -type Constant    -view existing_dft -active_state 1
set_dft_signal -port [get_ports test_mode] -type TestMode    -view spec         -active_state 1
set_dft_signal -port [get_ports SE]        -type ScanEnable  -view spec         -active_state 1 -usage scan
set_dft_signal -port [get_ports SI]        -type ScanDataIn  -view spec 
set_dft_signal -port [get_ports SO]        -type ScanDataOut -view spec 

############################# Create Test Protocol #####################

create_test_protocol
                            
###################### Pre-DFT Design Rule Checking ####################

dft_drc -verbose

############################# Preview DFT ##############################

preview_dft -show scan_summary

############################# Insert DFT ###############################

insert_dft

######################## Optimize Logic post DFT #######################

compile -scan -incremental

###################### Design Rule Checking post DFT ###################

dft_drc -verbose -coverage_estimate > reports/coverage.rpt

##################### Close Formality Setup file ###########################

set_svf -off

#############################################################################
# Write out files
#############################################################################

write_file -format verilog -hierarchy -output netlists/$top_module.ddc
write_file -format verilog -hierarchy -output netlists/$top_module.v
write_sdf  sdf/$top_module.sdf
write_sdc  -nosplit sdc/$top_module.sdc

####################### reporting ##########################################

report_area -hierarchy > reports/area.rpt
report_power -hierarchy > reports/power.rpt
report_timing -delay_type min -max_paths 20 > reports/hold.rpt
report_timing -delay_type max -max_paths 20 > reports/setup.rpt
report_clock -attributes > reports/clocks.rpt
report_constraint -all_violators -nosplit > reports/constraints.rpt

################# starting graphical user interface #######################

#gui_start

#exit
